cask_args appdir: "/Applications"

brew 'awscli'
brew 'cmake'
brew 'hub'
brew 'mas'
brew 'node'
brew 'postgis'
brew 'rbenv'
brew 'rbenv-communal-gems'
brew 'rbenv-default-gems'
brew 'rbenv-use'
brew 'rbenv-whatis'
brew 'redis'
brew 'yarn'

cask 'aws-vault'
cask 'docker'

mas "Slack", id: 803453959