cask_args appdir: "/Applications"

# IMC Development Requirements
cask 'homebrew/cask-versions/adoptopenjdk8'

brew 'cmake'
brew 'elasticsearch'
brew 'node'
brew 'postgis'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-use'
brew 'rbenv-whatis'
brew 'redis'
brew 'yarn'

# Useful tools
brew 'awscli'
brew 'hub'
brew 'pgcli'
brew 'the_silver_searcher'

# DevOps / Kubernetes
brew 'kube-ps1'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'kubernetes-cli'

cask 'aws-vault'
cask 'docker'
